app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT * FROM "items"