app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "student_id", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', 'b03b9c8aa3355ac6275efca5f425f1b882635bc1', NULL, '2009-10-18 02:12:58', '9a4ecfcf9d3bb4c93fb990723ebabdbadc72207b', NULL, '2009-10-18 02:12:58', NULL, 'quire', 'quire@example.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save